/* -----------------------------------------------------------------------------
| 第17回若年者ものづくり競技大会「電子回路組立て」職種
| 競技用ヘッダファイル
| ファイル名 [ move.h ] 
--------------------------------------------------------------------------------
 move.h 初版                 					D.Akamine
-------------------------------------------------------------------------------- */

#ifndef MOVE_H
#define	MOVE_H

#define XDOT_MAX 128
#define XDOT_HALF 64
#define YDOT_MAX 64
#define PAGE_MAX 8

/* -------------------------------- 関数宣言 -------------------------------- */
void Move_Mode1(void);			/*動作モード１*/
void Move_Mode2(void);			/*動作モード２*/
void Move_Mode3(void);			/*動作モード３*/
void Move_Mode4(void);			/*動作モード４*/
void Move_Mode5(void);			/*動作モード５*/

#endif	/* MOVE_H */

